Revit 2026 API

# CorrectionFactorSetErase Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	CorrectionFactor item
)
```
```vb
Public Overridable Function Erase (
	item As CorrectionFactor
) As Integer
```
```cpp
public:
virtual int Erase(
	CorrectionFactor^ item
)
```
```fsharp
abstract Erase :
        item : CorrectionFactor -> int
override Erase :
        item : CorrectionFactor -> int
```

#### Parameters

item CorrectionFactor

#### Return Value

Int32

#### Reference

CorrectionFactorSet Class

Autodesk.Revit.DB.Electrical Namespace